# DataFrame

The object DataFrame of the package pandas represents a table of data. Each column is a Series; the columns share a common index.

In [2]:
# print all the outputs in a cell
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

import pandas as pd
import numpy as np

In [3]:
%autosave 0

Autosave disabled

## Create a DataFrame

### From cmd

In [4]:
pd.DataFrame({'Apples': [30], 'Bananas': [21]})

# value必须用[]，

   Apples  Bananas
0      30       21

In [5]:
df_fruit = pd.DataFrame(
    {'Apples': [35, 41], 'Bananas': [21, 34]},\
    index=['2017 Sales', '2018 Sales']
)
#若不定义index，则index为default

In [6]:
df_fruit

            Apples  Bananas
2017 Sales      35       21
2018 Sales      41       34

### Write to a file

In [7]:
df_fruit.to_csv("fruit.csv")

In [8]:
ls

MSIS2607-Module 4-DataFrame.pptx
fruit.csv
module 4 -- data frame blank-Copy1.ipynb
module 4 -- data frame blank.ipynb
module 4 -- data frame complete.ipynb
module 4 -- data frame template.ipynb
students.csv
~$MSIS2607-Module 4-DataFrame.pptx

### From a file

Place the data file in the same folder as the ipynb file. Then, read it as follows:

In [9]:
df = pd.read_csv('students.csv')

In [10]:
df

         Name   hw1   hw2 program
0    Demetria   2.0   4.0    MSIS
1      Dorian  10.0  10.0    MSIS
2     Garland   9.0   1.0    MSIS
3   Iluminada   2.0   NaN     MBA
4    Jeannine   6.0   7.0    MSIS
5       Jenny   8.0   NaN     NaN
6        John   NaN  10.0    MSIS
7        Lucy   7.0   7.0    MSIS
8       Mercy   5.0   6.0    MSIS
9     Michael   6.0  10.0     MBA
10     Shelby   1.0  10.0    MSIS

By the default, the index is 0, 1, ...

Let us set the index as the column "Name".

In [11]:
df = df.set_index('Name')

In [12]:
df

            hw1   hw2 program
Name
Demetria    2.0   4.0    MSIS
Dorian     10.0  10.0    MSIS
Garland     9.0   1.0    MSIS
Iluminada   2.0   NaN     MBA
Jeannine    6.0   7.0    MSIS
Jenny       8.0   NaN     NaN
John        NaN  10.0    MSIS
Lucy        7.0   7.0    MSIS
Mercy       5.0   6.0    MSIS
Michael     6.0  10.0     MBA
Shelby      1.0  10.0    MSIS

## index, columns, values

<b>index</b> returns the index labels

In [13]:
df.index

Index(['Demetria', 'Dorian', 'Garland', 'Iluminada', 'Jeannine', 'Jenny',
       'John', 'Lucy', 'Mercy', 'Michael', 'Shelby'],
      dtype='object', name='Name')

<b>columns</b> returns the list of column names (as an index object)

In [14]:
df.columns

Index(['hw1', 'hw2', 'program'], dtype='object')

In [15]:
type(df.columns)

pandas.core.indexes.base.Index

<b>values</b> returns a (2-dimensional) ndarray of values

In [16]:
df.values # two dimensional array- row[]columns[]

array([[2.0, 4.0, 'MSIS'],
       [10.0, 10.0, 'MSIS'],
       [9.0, 1.0, 'MSIS'],
       [2.0, nan, 'MBA'],
       [6.0, 7.0, 'MSIS'],
       [8.0, nan, nan],
       [nan, 10.0, 'MSIS'],
       [7.0, 7.0, 'MSIS'],
       [5.0, 6.0, 'MSIS'],
       [6.0, 10.0, 'MBA'],
       [1.0, 10.0, 'MSIS']], dtype=object)

In [17]:
type(df.values)

numpy.ndarray

In [32]:
mask = (df.index >= 'J') & (df.index < 'K')
mask

array([False, False, False, False,  True,  True,  True, False, False,
       False, False])

In [33]:
df.loc[mask, :]
# mask 是要给boolean array, 可以当做row, 或者 column 放进df.loc[row,column]里面

          hw1   hw2 program
Name
Jeannine  6.0   7.0    MSIS
Jenny     8.0   NaN     NaN
John      NaN  10.0    MSIS

## df.iloc[x, y]

Access using the positional index. 
<ul>
<li><b>x</b> is the information needed to select the rows: positional index or range of integers</li>
<li><b>y (optional)</b> is the information needed to select the columns: positional index or range of integers</li>
</ul>

Access one row by specifying a positional index

In [19]:
df.iloc[2,:]

hw1           9
hw2           1
program    MSIS
Name: Garland, dtype: object

In [20]:
df

            hw1   hw2 program
Name
Demetria    2.0   4.0    MSIS
Dorian     10.0  10.0    MSIS
Garland     9.0   1.0    MSIS
Iluminada   2.0   NaN     MBA
Jeannine    6.0   7.0    MSIS
Jenny       8.0   NaN     NaN
John        NaN  10.0    MSIS
Lucy        7.0   7.0    MSIS
Mercy       5.0   6.0    MSIS
Michael     6.0  10.0     MBA
Shelby      1.0  10.0    MSIS

Or, more simply:

In [21]:
df.iloc[2]

hw1           9
hw2           1
program    MSIS
Name: Garland, dtype: object

Access one column by specifying positional index of the column

In [22]:
df.iloc[:,1]

Name
Demetria      4.0
Dorian       10.0
Garland       1.0
Iluminada     NaN
Jeannine      7.0
Jenny         NaN
John         10.0
Lucy          7.0
Mercy         6.0
Michael      10.0
Shelby       10.0
Name: hw2, dtype: float64

Access one specific value

In [23]:
df.iloc[2,1]

1.0

Access a subset of rows and of columns

In [24]:
df.iloc[:5,-2:]

            hw2 program
Name
Demetria    4.0    MSIS
Dorian     10.0    MSIS
Garland     1.0    MSIS
Iluminada   NaN     MBA
Jeannine    7.0    MSIS

## df.loc[x, y]

Access using the index labels. 
<ul>
<li><b>x</b> is the information needed to select the rows: label index, range of index labels, or boolean masks</li>
<li><b>y (optional)</b> is the information needed to select the columns: label index, range of index labels, or boolean masks</li>
</ul>

Acccess one specific value by specifying index label and column name

In [25]:
df

            hw1   hw2 program
Name
Demetria    2.0   4.0    MSIS
Dorian     10.0  10.0    MSIS
Garland     9.0   1.0    MSIS
Iluminada   2.0   NaN     MBA
Jeannine    6.0   7.0    MSIS
Jenny       8.0   NaN     NaN
John        NaN  10.0    MSIS
Lucy        7.0   7.0    MSIS
Mercy       5.0   6.0    MSIS
Michael     6.0  10.0     MBA
Shelby      1.0  10.0    MSIS

In [26]:
df.loc['Garland','hw2']

1.0

Access one row by specifying index label

In [27]:
df.loc['Garland',:]

hw1           9
hw2           1
program    MSIS
Name: Garland, dtype: object

or, more simply:

In [28]:
df.loc['Garland']

hw1           9
hw2           1
program    MSIS
Name: Garland, dtype: object

Access one column by specifying index label

In [29]:
df.loc[:,'hw1']

Name
Demetria      2.0
Dorian       10.0
Garland       9.0
Iluminada     2.0
Jeannine      6.0
Jenny         8.0
John          NaN
Lucy          7.0
Mercy         5.0
Michael       6.0
Shelby        1.0
Name: hw1, dtype: float64

In [61]:
# df.loc['hw1']   - WRONG!!
# df.loc[:,'hw1']  - RIGHT!
# df['hw1']  - RIGHT!
# df.hw1   - RIGHT!
# df.loc[row index, column index] 不能直接用column index

Or, more simply:

In [34]:
df['hw1']

Name
Demetria      2.0
Dorian       10.0
Garland       9.0
Iluminada     2.0
Jeannine      6.0
Jenny         8.0
John          NaN
Lucy          7.0
Mercy         5.0
Michael       6.0
Shelby        1.0
Name: hw1, dtype: float64

In [35]:
df.hw1

Name
Demetria      2.0
Dorian       10.0
Garland       9.0
Iluminada     2.0
Jeannine      6.0
Jenny         8.0
John          NaN
Lucy          7.0
Mercy         5.0
Michael       6.0
Shelby        1.0
Name: hw1, dtype: float64

Common mistake: get the whole row about Lucy

In [62]:
 # df['Lucy']  - WRONG!!!
# df.loc['Lucy']  - RIGHT!
# row index不能直接用df['column index']， 必须用df.loc[]

In [37]:
df.iloc[1]
# but can't just say df[1]
# df[]只能选column
# that will be wrong

hw1          10
hw2          10
program    MSIS
Name: Dorian, dtype: object

In [38]:
df.loc['Lucy']

hw1           7
hw2           7
program    MSIS
Name: Lucy, dtype: object

Select those students whose name starts with 'J'

In [39]:
df.loc[(df.index >= 'J') & (df.index < 'K'),:]

          hw1   hw2 program
Name
Jeannine  6.0   7.0    MSIS
Jenny     8.0   NaN     NaN
John      NaN  10.0    MSIS

In [40]:
df.iloc[(df.index >= 'J') & (df.index < 'K'),:]
# 用boolean iloc 和loc 一样都可以用
# 但是一旦 ： 变成label就不能用iloc,只能用loc

          hw1   hw2 program
Name
Jeannine  6.0   7.0    MSIS
Jenny     8.0   NaN     NaN
John      NaN  10.0    MSIS

## Problems

#### Retrieve Shelby's hw1 grade

In [41]:
df.loc['Shelby','hw1']

1.0

#### Retrieve Shelby's information

In [42]:
df.loc['Shelby']

hw1           1
hw2          10
program    MSIS
Name: Shelby, dtype: object

#### Find all information about those students that obtained the highest grade in hw2. Note that there are ties

In [43]:
df.hw2.nlargest(1)

Name
Dorian    10.0
Name: hw2, dtype: float64

In [44]:
df.hw2.nlargest()
# 错误做法！！

Name
Dorian      10.0
John        10.0
Michael     10.0
Shelby      10.0
Jeannine     7.0
Name: hw2, dtype: float64

So there are ties with grade equal to 10. Need to use .max() and boolean mask.

In [45]:
# 正确做法！！
df.hw2.max()

10.0

In [46]:
df[df.hw2 == df.hw2.max()] 
# df [] 里面的必须是一个column的boolean 
# df[boolean]返回一个df, 因为是df[满足此条件的]

          hw1   hw2 program
Name
Dorian   10.0  10.0    MSIS
John      NaN  10.0    MSIS
Michael   6.0  10.0     MBA
Shelby    1.0  10.0    MSIS

#### Find those students who obtained the same score in hw1 and in hw2.

In [47]:
df[df.hw1 == df.hw2]

         hw1   hw2 program
Name
Dorian  10.0  10.0    MSIS
Lucy     7.0   7.0    MSIS

In [48]:
df.loc[df.hw1 == df.hw2]

         hw1   hw2 program
Name
Dorian  10.0  10.0    MSIS
Lucy     7.0   7.0    MSIS

#### Find the average hw1 score of those students who got a hw2 score greater than 5.

In [49]:
df[df.hw2 > 5].hw1.mean()

5.833333333333333

or ..

In [50]:
df[df.loc[:,'hw2']>5].loc[:,'hw1'].mean()

5.833333333333333

## sort_values()

Sort the table based on the values of a set of columns (parameter <b>by</b>).

Sorting by one column

In [51]:
df.sort_values(by='hw1', ascending=False)

            hw1   hw2 program
Name
Dorian     10.0  10.0    MSIS
Garland     9.0   1.0    MSIS
Jenny       8.0   NaN     NaN
Lucy        7.0   7.0    MSIS
Jeannine    6.0   7.0    MSIS
Michael     6.0  10.0     MBA
Mercy       5.0   6.0    MSIS
Demetria    2.0   4.0    MSIS
Iluminada   2.0   NaN     MBA
Shelby      1.0  10.0    MSIS
John        NaN  10.0    MSIS

Sorting by more columns. For example, by hw1 descending and, in case of ties, by hw2 ascending

In [52]:
df.sort_values(by=['hw1','hw2'],ascending=[False,True])

            hw1   hw2 program
Name
Dorian     10.0  10.0    MSIS
Garland     9.0   1.0    MSIS
Jenny       8.0   NaN     NaN
Lucy        7.0   7.0    MSIS
Jeannine    6.0   7.0    MSIS
Michael     6.0  10.0     MBA
Mercy       5.0   6.0    MSIS
Demetria    2.0   4.0    MSIS
Iluminada   2.0   NaN     MBA
Shelby      1.0  10.0    MSIS
John        NaN  10.0    MSIS

## sort_index

In [53]:
df.sort_index()

            hw1   hw2 program
Name
Demetria    2.0   4.0    MSIS
Dorian     10.0  10.0    MSIS
Garland     9.0   1.0    MSIS
Iluminada   2.0   NaN     MBA
Jeannine    6.0   7.0    MSIS
Jenny       8.0   NaN     NaN
John        NaN  10.0    MSIS
Lucy        7.0   7.0    MSIS
Mercy       5.0   6.0    MSIS
Michael     6.0  10.0     MBA
Shelby      1.0  10.0    MSIS

## head and tail

Returns the first (or last) n rows

In [54]:
df.head()

            hw1   hw2 program
Name
Demetria    2.0   4.0    MSIS
Dorian     10.0  10.0    MSIS
Garland     9.0   1.0    MSIS
Iluminada   2.0   NaN     MBA
Jeannine    6.0   7.0    MSIS

In [55]:
df.tail()

         hw1   hw2 program
Name
John     NaN  10.0    MSIS
Lucy     7.0   7.0    MSIS
Mercy    5.0   6.0    MSIS
Michael  6.0  10.0     MBA
Shelby   1.0  10.0    MSIS

## Problems

#### Sort the MSIS students by hw2 descending.

In [56]:
df[df.program == 'MSIS'].sort_values(by='hw2',ascending=False)

           hw1   hw2 program
Name
Dorian    10.0  10.0    MSIS
John       NaN  10.0    MSIS
Shelby     1.0  10.0    MSIS
Jeannine   6.0   7.0    MSIS
Lucy       7.0   7.0    MSIS
Mercy      5.0   6.0    MSIS
Demetria   2.0   4.0    MSIS
Garland    9.0   1.0    MSIS

####  Show <b>only</b> the field <i>hw1</i> of the students with the largest hw2 grade

In [57]:
df[df.hw2==df.hw2.max()].hw1

Name
Dorian     10.0
John        NaN
Michael     6.0
Shelby      1.0
Name: hw1, dtype: float64

In [58]:
df[df.hw2==df.hw2.max()].loc[:,'hw1']

Name
Dorian     10.0
John        NaN
Michael     6.0
Shelby      1.0
Name: hw1, dtype: float64

## mean, min, max, etc

Aggregate functions are broadcasted to all columns (axis = 0, which is the default) or rows (axis = 1). Numeric aggregators will be executed only on numeric data.

The average for each hw

In [59]:
df.mean() # default axis = 0 to all columns  
# return series not data frame !!!!

hw1    5.600000
hw2    7.222222
dtype: float64

The average for each student

In [60]:
df.mean(axis = 1)

# john 的NaN 的hw1在计算mean的时候被当做0计算

Name
Demetria      3.0
Dorian       10.0
Garland       5.0
Iluminada     2.0
Jeannine      6.5
Jenny         8.0
John         10.0
Lucy          7.0
Mercy         5.5
Michael       8.0
Shelby        5.5
dtype: float64

In [63]:
df.max()

hw1    10.0
hw2    10.0
dtype: float64

## Problems

#### Compute the spread (i.e., highest minus lowest hw grade) of each student

let's try to use .max(axis=1) , find each row/student's max. Use .min(axis=1) to find the min.

In [65]:
df.max(axis=1) - df.min(axis=1)

Name
Demetria     2.0
Dorian       0.0
Garland      8.0
Iluminada    0.0
Jeannine     1.0
Jenny        0.0
John         0.0
Lucy         0.0
Mercy        1.0
Michael      4.0
Shelby       9.0
dtype: float64

In [82]:
# 对于jenny jeannine来说，他们有nan
# df.max 和 df.min 的值相同，因为nan, 所以最后相减为0 ！！！！！

Or

In [66]:
(df.hw1 - df.hw2).abs()
# dataframe 里trade NAN as 0
# series 如果有NAN就都变成NAN ！！！
# df.hw1 变成了series，nan 就还是nan

Name
Demetria     2.0
Dorian       0.0
Garland      8.0
Iluminada    NaN
Jeannine     1.0
Jenny        NaN
John         NaN
Lucy         0.0
Mercy        1.0
Michael      4.0
Shelby       9.0
dtype: float64

In [67]:
(df.loc[:,'hw1'] - df.loc[:, 'hw2']).abs()

Name
Demetria     2.0
Dorian       0.0
Garland      8.0
Iluminada    NaN
Jeannine     1.0
Jenny        NaN
John         NaN
Lucy         0.0
Mercy        1.0
Michael      4.0
Shelby       9.0
dtype: float64

What happen if the table has more than two homework columns ?

In [68]:
(df.columns > 'hw') & (df.columns < 'i')
# 以hw开头的

array([ True,  True, False])

In [83]:
hw = df.loc[:,(df.columns > 'hw') & (df.columns < 'i')]

In [85]:
# df[(df.columns > 'hw') & (df.columns < 'i')]
# 错误！！！
# 因为df.columns只有3个数字，但是一个column是11row,是11个数字

In [71]:
hw

            hw1   hw2
Name
Demetria    2.0   4.0
Dorian     10.0  10.0
Garland     9.0   1.0
Iluminada   2.0   NaN
Jeannine    6.0   7.0
Jenny       8.0   NaN
John        NaN  10.0
Lucy        7.0   7.0
Mercy       5.0   6.0
Michael     6.0  10.0
Shelby      1.0  10.0

In [72]:
spread = hw.max(axis = 1) - hw.min(axis = 1)
spread

Name
Demetria     2.0
Dorian       0.0
Garland      8.0
Iluminada    0.0
Jeannine     1.0
Jenny        0.0
John         0.0
Lucy         0.0
Mercy        1.0
Michael      4.0
Shelby       9.0
dtype: float64

#### Who has the largest spread?

In [86]:
spread.nlargest(1)

Name
Shelby    9.0
dtype: float64

## Modifying DataFrames

Make a copy of the data frame

In [87]:
df1 = df

In [88]:
df1 is df

True

In [89]:
df2 = df.copy() # in case of changeing the original data

In [90]:
df2 is df

False

### Add rows

A new student has joined. His name is Oliver and he is the MSIS program; his hw1 is missing and his hw2 score is 8.

In [91]:
df2.loc['Oliver'] = [np.nan, 8, 'MSIS'] 
# np.nan numpy 的 nan 数据

In [92]:
type(np.nan)

float

In [93]:
df2

            hw1   hw2 program
Name
Demetria    2.0   4.0    MSIS
Dorian     10.0  10.0    MSIS
Garland     9.0   1.0    MSIS
Iluminada   2.0   NaN     MBA
Jeannine    6.0   7.0    MSIS
Jenny       8.0   NaN     NaN
John        NaN  10.0    MSIS
Lucy        7.0   7.0    MSIS
Mercy       5.0   6.0    MSIS
Michael     6.0  10.0     MBA
Shelby      1.0  10.0    MSIS
Oliver      NaN   8.0    MSIS

A new student has joined. Her name is Caroline and she got 4 in hw2. She is not in any program yet.

In [94]:
df2.loc['Caroline','hw2'] = 4 
# 不定以的数据自动变成nan

In [95]:
df2

            hw1   hw2 program
Name
Demetria    2.0   4.0    MSIS
Dorian     10.0  10.0    MSIS
Garland     9.0   1.0    MSIS
Iluminada   2.0   NaN     MBA
Jeannine    6.0   7.0    MSIS
Jenny       8.0   NaN     NaN
John        NaN  10.0    MSIS
Lucy        7.0   7.0    MSIS
Mercy       5.0   6.0    MSIS
Michael     6.0  10.0     MBA
Shelby      1.0  10.0    MSIS
Oliver      NaN   8.0    MSIS
Caroline    NaN   4.0     NaN

### Add columns

Add an "empty" column <b>hw3</b>

In [96]:
df2 = df.copy()

In [ ]:
df2['hw3'] = np.nan

In [ ]:
df2

### Add calculated columns

In [ ]:
df2 = df.copy()

Let's add a column with the final grade. It is computed as 0.2\*hw1 + 0.8\*hw2.

In [ ]:
df2['finalGrade'] = 0.2 * df2.hw1 + 0.8 * df.hw2
df2